import time
from time import sleep
username = input("Введіть своє ім'я: ")
print(f"Вітаю тебе на тесті з історії, {username}!")
time.sleep(1.5)
print("Це продовження того, що зробив Міша, тобто програмка)")
time.sleep(2)
print("Я надіюся ви запам'ятали те, що вам він показував?")
time.sleep(2)
print("Не буду затягувати, переходим до питань! У вас тільки є по одній спробі... Будьте уважними!")
time.sleep(2)
first_question = input("В якому році мореплавець Христофор Колумб здійснив одне з найбільших відкриттів в історії людства?: ")
if first_question == "1492":
    print("Правильно! Переходимо до наступного питання!")
else:
    print("Відповідь не правильна! Переходимо до наступного питання!")
time.sleep(2)
second_question = input("В якому столітті вікінги здійснювали подорожі?: ")
if second_question == "10":
    print("Ого, друге питання і ще все правильно! Переходимо до наступного")
else:
    print("Не правильно! ти не з тої ноги прокинувся?")
time.sleep(2)
third_question = input("Близько скількох років до нашої ери жителі Америки почали займматися землеробством?: ")
if third_question == "7000":
    print("Як я поняв, ти не збираєшся здаватися, чи не так? Третє питання правильно!")
else:
    print("Ти не збираєшся думати головою... Не правильна відповідь!")
time.sleep(2)
fourth_question = input("Які є найвідоміші цивілізації Мезоамерики та Південної Америки?: ")
if fourth_question == "мая ацтеки та інки":
    print("Правильно! Бачу ви всі сьогодні в ударі!")
else:
    print("Ех... Жаль шо ти нічого не знаєш... Не правильна відповідь!")
time.sleep(2)
fifth_question = input("В яких роках існувала імперія Інків?: ")
if fifth_question == "1438-1533":
    print("Да ти там все на память зубриш чи що!? Правильно! :D")
else:
    print("Я вже не знаю що навіть сказати... Не правильно! :(")
time.sleep(2)
sixth_question = input("Як називався рід Інків?: ")
if sixth_question == "сини Сонця":
    print("Правильно!")
else:
    print("Не правильно!")
time.sleep(2)
seventh_question = input("В які століття існувала імперія Ацтеків?: ")
if seventh_question == "12-16":
    print("Да ну, більшість питань правильно!")
else:
    print("А ти там случайно не розлінився відповідати?")
time.sleep(2)
eighth_question = input("Звідки прийшла імперія Ацтеків?: ")
if eighth_question == "з півночі":
    print("Правильно!")
else:
    print("Не правильно!")
time.sleep(2)
nineth_question = input("Коли існувала цивілізація Мая?: ")
if nineth_question == "1999 рік - 16 ст.":
    print("Правильно!")
else:
    print("Не правильно!")
time.sleep(2)
ten_question = input("Що створила цивілізація Мая?: ")
if ten_question == "точний сонячний календар":
    print("Правильно!")
else:
    print("Не правильно!")
time.sleep(2)
print("Тест закінчено!")
time.sleep(2)
print("Я надіюся вам сподобалося те що ми з Мішом зробили?")
time.sleep(2)
print("Це все що ми зробили! Дякую за увагу!")
